---
type: PlasticVinyl
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 12
tags: [revit-api, class]
---

# PlasticVinyl

`Autodesk.Revit.DB.Visual.PlasticVinyl` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | PlasticvinylApplication | 2018.1 | `public static string PlasticvinylApplication { get ; }` |
| Property | PlasticvinylBump | 2018.1 | `public static string PlasticvinylBump { get ; }` |
| Property | PlasticvinylBumpAmount | 2018.1 | `public static string PlasticvinylBumpAmount { get ; }` |
| Property | PlasticvinylBumpMap | 2018.1 | `public static string PlasticvinylBumpMap { get ; }` |
| Property | PlasticvinylColor | 2018.1 | `public static string PlasticvinylColor { get ; }` |
| Property | PlasticvinylColorByObject | 2018.1 | `public static string PlasticvinylColorByObject { get ; }` |
| Property | PlasticvinylPattern | 2018.1 | `public static string PlasticvinylPattern { get ; }` |
| Property | PlasticvinylPatternAmount | 2018.1 | `public static string PlasticvinylPatternAmount { get ; }` |
| Property | PlasticvinylPatternMap | 2018.1 | `public static string PlasticvinylPatternMap { get ; }` |
| Property | PlasticvinylType | 2018.1 | `public static string PlasticvinylType { get ; }` |